In [1]:
import pandas as pd
import numpy as np

np.random.seed(123)

students = ['Sally', 'Jane', 'Suzie', 'Billy', 'Ada', 'John', 'Thomas',
            'Marie', 'Albert', 'Richard', 'Isaac', 'Alan']

# randomly generate scores for each student for each subject
# note that all the values need to have the same length here
math_grades = np.random.randint(low=60, high=100, size=len(students))
english_grades = np.random.randint(low=60, high=100, size=len(students))
reading_grades = np.random.randint(low=60, high=100, size=len(students))

df = pd.DataFrame({'name': students,
                   'math': math_grades,
                   'english': english_grades,
                   'reading': reading_grades,
                   'classroom': np.random.choice(['A', 'B'], len(students))})

In [3]:
df

       name  math  english  reading classroom
0     Sally    62       85       80         A
1      Jane    88       79       67         B
2     Suzie    94       74       95         A
3     Billy    98       96       88         B
4       Ada    77       92       98         A
5      John    79       76       93         B
6    Thomas    82       64       81         A
7     Marie    93       63       90         A
8    Albert    92       62       87         A
9   Richard    69       80       94         A
10    Isaac    92       99       93         B
11     Alan    92       62       72         A

In [2]:
pd.DataFrame({'A': [1, 2, 3], 'B': [4, 5, 6]})

   A  B
0  1  4
1  2  5
2  3  6

In [4]:
pd.DataFrame([[1, 2, 3], [4, 5, 6]])

   0  1  2
0  1  2  3
1  4  5  6

In [5]:
data = np.array([[1, 2, 3], [4, 5, 6]])

pd.DataFrame(data, columns=['a', 'b', 'c'])

   a  b  c
0  1  2  3
1  4  5  6

In [6]:
data

array([[1, 2, 3],
       [4, 5, 6]])

In [7]:
df.reading.agg('min')

67

In [10]:
df[['english', 'reading', 'math']].agg(['mean', 'min', 'max'])

        english  reading       math
mean  77.666667     86.5  84.833333
min   62.000000     67.0  62.000000
max   99.000000     98.0  98.000000

In [11]:
df.groupby('classroom').math.max()

classroom
A    94
B    98
Name: math, dtype: int64

In [16]:
more_data = np.array([[7, 8, 9], [10, 11, 12]])

new_df = pd.DataFrame(more_data)

new_df

    0   1   2
0   7   8   9
1  10  11  12

In [18]:
new_df.columns = ["a", "b", "c"]
new_df

    a   b   c
0   7   8   9
1  10  11  12

In [19]:
# iloc is the integer location and iloc can specify which number row

### File types

**.csv** stands for "comma separtated values" = spreadsheets
- datasets from a vendor

**.json** is a data interchange format
- stands for javascript object notation == exactly the same as python lists/dictionary syntax
- python dictionary == js object

When writing data, write to a csv for less duplication

In [20]:
from pydataset import data
mpg = data("mpg")

In [22]:
mpg.to_csv("mpg.csv")

In [24]:
df.groupby("classroom").reading.median()

classroom
A    88.5
B    90.5
Name: reading, dtype: float64

In [25]:
df.groupby("classroom").reading.describe()

           count    mean        std   min    25%   50%    75%   max
classroom
A            8.0  87.125   8.887190  72.0  80.75  88.5  94.25  98.0
B            4.0  85.250  12.392874  67.0  82.75  90.5  93.00  93.0

In [28]:
# possible to iterate a groupby object; not recomended
for x in df.groupby("classroom"):
    print(x)

('A',        name  math  english  reading classroom
0     Sally    62       85       80         A
2     Suzie    94       74       95         A
4       Ada    77       92       98         A
6    Thomas    82       64       81         A
7     Marie    93       63       90         A
8    Albert    92       62       87         A
9   Richard    69       80       94         A
11     Alan    92       62       72         A)
('B',      name  math  english  reading classroom
1    Jane    88       79       67         B
3   Billy    98       96       88         B
5    John    79       76       93         B
10  Isaac    92       99       93         B)

In [29]:
df["passing_math"] = df["math"] >= 70
df["passing_english"] = df["english"] >= 70
df["passing_reading"] = df["reading"] >= 70

In [30]:
df

,name,math,english,reading,classroom,passing_math,passing_english,passing_reading
0,Sally,62,85,80,A,False,True,True
1,Jane,88,79,67,B,True,True,False
2,Suzie,94,74,95,A,True,True,True
3,Billy,98,96,88,B,True,True,True
4,Ada,77,92,98,A,True,True,True
5,John,79,76,93,B,True,True,True
6,Thomas,82,64,81,A,True,False,True
7,Marie,93,63,90,A,True,False,True
8,Albert,92,62,87,A,True,False,True
9,Richard,69,80,94,A,False,True,True
10,Isaac,92,99,93,B,True,True,True
11,Alan,92,62,72,A,True,False,True

In [31]:
df.groupby(["passing_english", "passing_math", "passing_reading"]).mean()

                                               math  english  reading
passing_english passing_math passing_reading
False           True         True             89.75    62.75     82.5
True            False        True             65.50    82.50     87.0
                True         False            88.00    79.00     67.0
                             True             88.00    87.40     93.4

In [34]:
passing_all = df.passing_english & df.passing_math & df.passing_reading
passing_all

0     False
1     False
2      True
3      True
4      True
5      True
6     False
7     False
8     False
9     False
10     True
11    False
dtype: bool

In [36]:
df["passing_all"] = passing_all

In [37]:
df

,name,math,english,reading,classroom,passing_math,passing_english,passing_reading,passing_all
0,Sally,62,85,80,A,False,True,True,False
1,Jane,88,79,67,B,True,True,False,False
2,Suzie,94,74,95,A,True,True,True,True
3,Billy,98,96,88,B,True,True,True,True
4,Ada,77,92,98,A,True,True,True,True
5,John,79,76,93,B,True,True,True,True
6,Thomas,82,64,81,A,True,False,True,False
7,Marie,93,63,90,A,True,False,True,False
8,Albert,92,62,87,A,True,False,True,False
9,Richard,69,80,94,A,False,True,True,False
10,Isaac,92,99,93,B,True,True,True,True
11,Alan,92,62,72,A,True,False,True,False

In [40]:
df.groupby("passing_all").min()

,name,math,english,reading,classroom,passing_math,passing_english,passing_reading
passing_all,,,,,,,,
False,Alan,62,62,67,A,False,False,False
True,Ada,77,74,88,A,True,True,True

In [41]:
df.groupby("passing_all").mean()

,math,english,reading,passing_math,passing_english,passing_reading
passing_all,,,,,,
False,82.571429,70.714286,81.571429,0.714286,0.428571,0.857143
True,88.000000,87.400000,93.400000,1.000000,1.000000,1.000000

In [44]:
pd.crosstab(df.passing_all, df.classroom)

classroom    A  B
passing_all
False        6  1
True         2  3

In [47]:
df.pivot_table(values="math", index="classroom", columns="passing_math", aggfunc="mean")

passing_math  False      True
classroom
A              65.5  88.333333
B               NaN  89.250000

In [ ]:
df.pipe